sandytrails/app/controllers/beaches_controller.rb

DELETE FROM "beaches" WHERE "beaches"."id" = ?  [["id", 19]]
---
  def destroy
    @beach_to_delete = Beach.find(params[:id])
    @beach_to_delete.delete