sandytrails/app/controllers/beaches_controller.rb

  def index
    if params[:open] == "true"
      @page_title = "Open Beaches"
      @beaches = Beach.open
    else
    @page_title = "Lifes A Beach"
    @beaches = Beach.all
---
SELECT "beaches".* FROM "beaches" WHERE "beaches"."open" = ?  [["open", 1]]

  def show
    @beach = Beach.find(params[:id])
---
SELECT "beaches".* FROM "beaches" WHERE "beaches"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def create
    #byebug
    @beach = Beach.new(beach_params)
    if @beach.valid?
      @beach.save
---
INSERT INTO "beaches" ("name", "location", "open", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Goggle Beach"], ["location", "GHTFG"], ["open", 1], ["created_at", "2020-11-04 21:58:23.985306"], ["updated_at", "2020-11-04 21:58:23.985306"]]

  def edit
    @beach = Beach.find(params[:id])
---
SELECT "beaches".* FROM "beaches" WHERE "beaches"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def update
    #byebug
    @beach = Beach.find(params[:id])
    @beach.update(beach_params)
---
SELECT "beaches".* FROM "beaches" WHERE "beaches"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "beaches" SET "name" = ?, "location" = ?, "updated_at" = ? WHERE "beaches"."id" = ?  [["name", "Goggle"], ["location", "Tays"], ["updated_at", "2020-11-04 21:59:14.862973"], ["id", 35]]

  def destroy
    @beach_to_delete = Beach.find(params[:id])
    @beach_to_delete.delete
---
SELECT "beaches".* FROM "beaches" WHERE "beaches"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "beaches" WHERE "beaches"."id" = ?  [["id", 33]]