sandytrails/app/controllers/visitors_controller.rb

SELECT "visitors".* FROM "visitors"
---
  def index
    @visitors = Visitor.all

SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
---
  def show
    @visitor = Visitor.find(params[:id])

INSERT INTO "visitors" ("name", "age", "city", "mermaid_descendant", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Alyssa"], ["age", 5], ["city", "Mars"], ["mermaid_descendant", 1], ["created_at", "2020-11-04 21:52:53.130877"], ["updated_at", "2020-11-04 21:52:53.130877"]]
---
  def create
    @visitor = Visitor.new(visitor_params)
    if @visitor.valid?
      @visitor.save

SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
---
  def edit
    @visitor = Visitor.find(params[:id])

SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
UPDATE "visitors" SET "name" = ?, "age" = ?, "updated_at" = ? WHERE "visitors"."id" = ?  [["name", "Quicksilver"], ["age", 34], ["updated_at", "2020-11-04 22:43:38.721076"], ["id", 31]]
---
  def update
    @visitor = Visitor.find(params[:id])
    @visitor.update(visitor_params)

SELECT "visitors".* FROM "visitors" WHERE "visitors"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
DELETE FROM "visitors" WHERE "visitors"."id" = ?  [["id", 31]]
---
  def destroy
    @visitor = Visitor.find(params[:id])
    @visitor.delete