sandytrails/app/views/visitors/show.html.erb

    <li><%= @visitor.mermaid_descendant%></li>
<% @visitor.trips.each do |trip|%>
---
SELECT "trips".* FROM "trips" WHERE "trips"."visitor_id" = ?  [["visitor_id", 30]]